{"/my-hugo-website/docs/":{"data":{"":"","benefits#Benefits":" Secured, persisted, and accessible storage that enables you to keep all your data in a unique central place. Seamlessly access your entities, records, and documents for all your UiPath ® products. Store completely new and also existing data. Define, modify, and extend business entities and store records for those entities apart from the standard out-of-the-box features. Define rich metadata like relationships, rules, attributes for your entities, and store documents associated with the defined entities. ","overview#Overview":"UiPath® Data Service is a persistent data storage service that brings powerful no-code data modeling and storage capabilities to your Robotic Process Automation (RPA) projects.\nUiPath® Data Service provides a business yet user-friendly service where you can securely store and manage your business data within UiPath:\nRun unattended processes to aggregate data from multiple systems before processing it in other systems. Use the data for long-running business processes that need to transfer data across multiple attended and unattended processes. The integration with Studio and UiPath® Robot allows you to build automations leveraging capabilities such as: Rich relational data types; Integrated security; Instantaneous and adjustable provisioning and deployments. ","prerequisites#Prerequisites":"To start using the Data Service in Automation Suite you first need to install Automation Suite and enable Data Service in the configuration file.\nTo use the Entities in UiPath Studio, the following requirements need to be met:\nSame version UiPath Studio or higher, Enterprise or Community edition; UiPath Assistant or Robot connected to a Modern folder; See the corresponding Orchestrator instructions on how to connect the Robot. Data Service enabled for your tenant . ","use-cases#Use Cases":"Below is a list of some common use cases for Data Service:\nCapturing data about employee needsSay you create a new process for capturing data about employees needs (i.e. desks, chairs, webcams, etc.).Problem: The data can be extensive and must be stored before creating requests in the procurement system.Solution: Instead of using a database, a file share, or cloud storages, you can store them in UiPath® Data Service.\nMonthly financial reportingProcesses for monthly financial reporting get data from multiple systems like bookings, invoices, billings, and payments.Problem: Both attended and unattended workflows retrieve this data every time they run. This requires all users to have access and connectivity to all the backend systems, which can cause delays and inconsistencies in reporting, as underlying data may change before all your processes are completed.Solution: You can write one unattended workflow to gather all the required data in Data Service. Then, all your other attended or unattended workflows can work with it. This may also eliminate the need for storing the aggregated critical business data in files on user or robot machines.\nAn orchestration process using queuesSay you design an orchestration process that includes human-robot interaction for payments of supplier invoices and transfers all the data via queues.Solution: You can store the invoices in Data Service, pass around the record ID via queues, and work with one version of the truth. You can also create new processes to provide full visibility on all invoices in your system from Data Service.\nReview customers before inputting them in CRMSay you are working on an unattended business process to create a 360-degree view of your customers before you write it in your customer relationship management (CRM) system.Problem: The workflows have tens, maybe hundreds of variables.Solution: You can model your customer entity in Data Service, import the definition in Studio, and work with a single variable in your workflows before dispersing it across your various systems of record. Data must not necessarily be stored in Data Service."},"title":"Introduction to UiPath"},"/my-hugo-website/docs/advanced-search-in-entity-data/":{"data":{"":"","editing-an-advanced-search-query#Editing an Advanced Search Query":"","roles#Roles":"","searching-for-data#Searching for Data":"","sharing-the-advanced-search-query#Sharing the Advanced Search Query":"Entities contain a large amount of data which can be difficult to navigate and query.\nThe advanced search feature allows you to find any entity data, by querying any of the data fields.\nRoles\rYou need the Data Reader role to see and query entity data. See more details on how to Manage access.\nSearching for Data\rTo use the Search in field:Navigate to the Data tab of the desired entity in Data Service. From the Search in: dropdown, select the entity fields you want to retrieve results from.The search algorithm looks up number and text data-type fields.In the Search field, enter the search string. The grid displays the queried results. To apply more filters on your results list, click Advanced Search. This opens the Advanced Search panel on the right-hand side.\nTo use Advanced Search:Select the operator:AND - to return the entries that match all conditionsOR - to return the entries that match any of the conditionsDefine the conditions:Column - select the entity field to apply your condition to. Condition - select the condition. Value - enter the value for your condition. The value must be of the same type as the field type. For example, use strings for Text fields, use integers for Number fields. Click Add to add as many conditions as you need.To remove a conditions, click the corresponding Delete icon.Click Save to rerun the search. The page refreshes with the new results.\nEditing an Advanced Search Query\rClick the Edit icon. Add new conditions, remove or update existing conditions. Click Save to rerun the search. To clear the search results, click Basic search or Clear search.\nCreating a new query removes the currently saved one.\nSharing the Advanced Search Query\rTo share the query results with other Data Service users, click Copy link to Query.\nThe search query is user-specific, and other users can see the query results provided they have read permissions on the queried entity.Both the query and the query link are persisted across sessions after a Copy link to Query operation has been used."},"title":"Advanced search in entity data"},"/my-hugo-website/docs/choice-sets/":{"data":{"":"","accessing-the-choice-sets-module#Accessing the Choice Sets Module":"","creating-a-choice-set#Creating a Choice Set":"","deleting-choice-sets#Deleting Choice Sets":"The Choice Sets module enables you to manage choice sets for a data service tenant. Choice sets can be used as field types in an entity.\nA choice set consists of choice values that can be selected from for a field based on that choice set. The choice set is also made available in Studio as Enum value.\nLearn how to manage your choice sets: access, create, update or delete your Data Service choice sets.\nAccessing the Choice Sets Module\rOn the Data Service page, click the More options menu in the upper right corner.Select Choice Sets. The Choice Sets page is displayed.\nCreating a Choice Set\rOn the Choice Sets page, click Add Choice Set. The Create Choice Set panel is displayed.In the Display Name field enter a display name for the choice set.The Name field is automatically filled in based on the Display Name. If needed, you can update it.You can create a maximum of 250 choices in a choice set.Click Add Choice.Enter a name in the new choice display name field. Repeat steps 3 and 4 for the other choices you want to add to the choice set.Click More details to display an additional Description field. If needed, enter a description to indicate the function of the choice set.Click Save.\nThe new choice set is displayed in the Choice Sets list.\nUpdating a Choice Set\rYou cannot change the Name of the choice set and the individual choices.\nHover over the choice set that you want to edit.Click the Edit icon corresponding to the choice set. This is available on the right-hand side.The Edit Choice Set panel is displayed. Here you can change the Display Name, remove choices and/or add new choices.Click Save.\nDeleting Choice Sets\rYou cannot delete a choice set that is being used in a field or a system-built choice set.\nHover over the choice set that you want to delete.Click the Delete icon corresponding to the choice set. This is available on the right-hand side.Enter the display name of the choice set in the Delete Choice Set dialog box.Click Delete to confirm the action.\nThe video below shows how to manage a choice set:","updating-a-choice-set#Updating a Choice Set":""},"title":"Choice sets"},"/my-hugo-website/docs/getting-started/":{"data":{"":"","benefits#Benefits":" Secured, persisted, and accessible storage that enables you to keep all your data in a unique central place. Seamlessly access your entities, records, and documents for all your UiPath ® products. Store completely new and also existing data. Define, modify, and extend business entities and store records for those entities apart from the standard out-of-the-box features. Define rich metadata like relationships, rules, attributes for your entities, and store documents associated with the defined entities. ","overview#Overview":"UiPath® Data Service is a persistent data storage service that brings powerful no-code data modeling and storage capabilities to your Robotic Process Automation (RPA) projects.\nUiPath® Data Service provides a business yet user-friendly service where you can securely store and manage your business data within UiPath:\nRun unattended processes to aggregate data from multiple systems before processing it in other systems. Use the data for long-running business processes that need to transfer data across multiple attended and unattended processes. The integration with Studio and UiPath® Robot allows you to build automations leveraging capabilities such as: Rich relational data types; Integrated security; Instantaneous and adjustable provisioning and deployments. ","prerequisites#Prerequisites":"To start using the Data Service in Automation Suite you first need to install Automation Suite and enable Data Service in the configuration file.\nTo use the Entities in UiPath Studio, the following requirements need to be met:\nSame version UiPath Studio or higher, Enterprise or Community edition; UiPath Assistant or Robot connected to a Modern folder; See the corresponding Orchestrator instructions on how to connect the Robot. Data Service enabled for your tenant . ","use-cases#Use Cases":"Below is a list of some common use cases for Data Service:\nCapturing data about employee needsSay you create a new process for capturing data about employees needs (i.e. desks, chairs, webcams, etc.).Problem: The data can be extensive and must be stored before creating requests in the procurement system.Solution: Instead of using a database, a file share, or cloud storages, you can store them in UiPath® Data Service.\nMonthly financial reportingProcesses for monthly financial reporting get data from multiple systems like bookings, invoices, billings, and payments.Problem: Both attended and unattended workflows retrieve this data every time they run. This requires all users to have access and connectivity to all the backend systems, which can cause delays and inconsistencies in reporting, as underlying data may change before all your processes are completed.Solution: You can write one unattended workflow to gather all the required data in Data Service. Then, all your other attended or unattended workflows can work with it. This may also eliminate the need for storing the aggregated critical business data in files on user or robot machines.\nAn orchestration process using queuesSay you design an orchestration process that includes human-robot interaction for payments of supplier invoices and transfers all the data via queues.Solution: You can store the invoices in Data Service, pass around the record ID via queues, and work with one version of the truth. You can also create new processes to provide full visibility on all invoices in your system from Data Service.\nReview customers before inputting them in CRMSay you are working on an unattended business process to create a 360-degree view of your customers before you write it in your customer relationship management (CRM) system.Problem: The workflows have tens, maybe hundreds of variables.Solution: You can model your customer entity in Data Service, import the definition in Studio, and work with a single variable in your workflows before dispersing it across your various systems of record. Data must not necessarily be stored in Data Service."},"title":"Getting Started"},"/my-hugo-website/docs/using-data-service/":{"data":{"":"","data-service-configuration-checklist#Data Service Configuration Checklist":"Home Page Experience\rThe Data Service tab is displayed on the left-hand of the Automation Suite home page. The More options menu displays the following options: Choice Sets, Manage Access, API Access. On the Entities page header the following operations are available: Import/Export , Use in Studio , Refresh . Editing Entities\rOn the Entities page, clicking the Create New Entity button opens the Create Entity panel on the right-side. In case of entities available for review, clicking every entity redirects you to the Fields page. Adding a new field activates the Add New Data button in the Data tab and on the page header. Deleting a field or an entity requires you to input the field or entity name for confirmation. Editing Choice Sets\rOn the Choice Sets page, clicking the Add Choice Set button opens the Create Choice Set panel on the right-side. In case of choice sets available for review, clicking the corresponding Edit button opens the Edit Choice Set panel on the right-side. Deleting a choice set requires you to input the choice set name for confirmation. Using File Fields\rIn Data Service, you can add file fields to upload files or download files using Studio or Data Service dedicated activities.\nUploading a fileFor a Data Service entity of your choice, create a field of type File. Click on the Add data button. A panel opens to the right-side, allowing you to upload a file from your computer in the “File” type field of your entity. Provide a transaction identifier and click Save. The file is logged as a new record of your entity.\nDownloading a fileOn the Entities page, click the entity with populated File fields. Switch to the Data tab. Identify the record with the populated File field. Click the corresponding More options menu. Select Download to download the file to our computer.\nEditing Roles\rAssigning rolesOn the Manage Access \u003e Assign Roles page, you can see the users and groups available for role assignments. On the page header, clicking the Assign Roles button opens the Assign Roles panel on the right-side. Search for the user or group you want to assign roles to and select the desired roles. In case of users or groups available for role assignments, clicking the corresponding Edit button opens the Edit Roles panel on the right-side. Removing a user or group informs you about the permanent outcome of the operation.\nCreating rolesOn the Manage Access \u003e Roles page, you can see the standard and custom roles available for assignments. On the page header, clicking the Create New Role button opens the Create Role panel on the right-side. In case of custom roles available for assignments, clicking the corresponding Edit button opens the Update Role panel on the right-side. Standard roles are read-only, so clicking the corresponding View permissions button opens the View Role panel on the right-side. Deleting a role requires you to input the role name for confirmation.\nConnecting Data Service to Other UiPath®\rApplications Import Data Service entities in Studio following the procedure documented here . Add Data Service entities in Apps following the procedure documented here . Using Data Service APIs\rOn the Data Service page header, click the More options menu. Select API Access . This opens a pop-up window prompting you to either copy the OpenAPI link or to download the OpenAPI file. ","installing-automation-suite#Installing Automation Suite":"See how to install Automation Suite, or Automation Suite on EKS/AKS.","ready-for-use#Ready for use":"As soon you tick the above checkboxes, you are ready to manage Data Service in the on-premises environment provided by Automation Suite.\nPut your knowledge to good use.","the-user-interface#The User Interface":"The Data Service option is available in your UiPath organization as a tenant-level service that must be enabled. Please check the Enabling the Data Service page for step by step details. Once the service enabled, the Data Service icon appears on the left navigation bar.\nObjects created in Data Service are referred to as Entities.\nTo create a new entity or display and manage already created ones, click the Data Service icon.\nSeveral options become available:\nCreate a new entity Customizing the entity by creating new fields Creating relationships between your created entities Use an already created entity in Studio To see the list of languages Data Service is available in, see the Language Support table.\nThe option to switch the language preference is available from the user menu."},"title":"Using Data Service"},"/my-hugo-website/docs/using-data-service/advanced-search-in-entity-data/":{"data":{"advanced-search-in-entity-data#Advanced Search in Entity Data":"","editing-an-advanced-search-query#Editing an Advanced Search Query":"","roles#Roles":"","searching-for-data#Searching for Data":"","sharing-the-advanced-search-query#Sharing the Advanced Search Query":"Advanced Search in Entity DataEntities contain a large amount of data which can be difficult to navigate and query.\nThe advanced search feature allows you to find any entity data, by querying any of the data fields.\nRoles\rYou need the Data Reader role to see and query entity data. See more details on how to Manage access.\nSearching for Data\rTo use the Search in field:Navigate to the Data tab of the desired entity in Data Service. From the Search in: dropdown, select the entity fields you want to retrieve results from.The search algorithm looks up number and text data-type fields.In the Search field, enter the search string. The grid displays the queried results. To apply more filters on your results list, click Advanced Search. This opens the Advanced Search panel on the right-hand side.\nTo use Advanced Search:Select the operator:AND - to return the entries that match all conditionsOR - to return the entries that match any of the conditionsDefine the conditions:Column - select the entity field to apply your condition to. Condition - select the condition. Value - enter the value for your condition. The value must be of the same type as the field type. For example, use strings for Text fields, use integers for Number fields. Click Add to add as many conditions as you need.To remove a conditions, click the corresponding Delete icon.Click Save to rerun the search. The page refreshes with the new results.\nEditing an Advanced Search Query\rClick the Edit icon. Add new conditions, remove or update existing conditions. Click Save to rerun the search. To clear the search results, click Basic search or Clear search.\nCreating a new query removes the currently saved one.\nSharing the Advanced Search Query\rTo share the query results with other Data Service users, click Copy link to Query.\nThe search query is user-specific, and other users can see the query results provided they have read permissions on the queried entity.Both the query and the query link are persisted across sessions after a Copy link to Query operation has been used."},"title":"Advanced Search in Entity Data"},"/my-hugo-website/docs/using-data-service/creating-relationships/":{"data":{"creating-relationships#Creating Relationships":"Creating RelationshipsFollow these steps to create a relationship between your entities.\nIn the Entities list, select the entity for which you want to add a relationship.In the Fields tab, click Create New Field.In the Create Field panel enter a Display Name in the corresponding field.Select Relationship from the Type drop-down list.Select the entity to which you want to create a relationship from the Related Entity drop-down list.Select the display field to be shown in the user interface from the Related Entity Display Field drop-down list.Click Save.\nThe relationship is added as a new field in the Fields tab.When adding data you can select values from the related entity.Click View Entry Data to display the Data tab of the related entity in a new browser tab."},"title":"Creating Relationships"}}